#   _____
#  |_   _|_ _ _ __  ___
#    | |/ _` | '_ \/ __|
#    | | (_| | |_) \__ \
#    |_|\__,_| .__/|___/
#            |_|

tap "0xazure/tap"
tap "devlocker/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

#   _  __ 
#  | |/ /___  __ _ ___
#  | ' // _ \/ _` / __|
#  | . \  __/ (_| \__ \
#  |_|\_\___|\__, |___/
#            |___/

# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Modern replacement for 'ls'
brew "exa"
# Identify or delete duplicate files
brew "fdupes"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git", args: ["with-openssl"]
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Command line utility to live-reload your application.
brew "devlocker/tap/tychus"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

#    ____          _
#   / ___|__ _ ___| | _____
#  | |   / _` / __| |/ / __|
#  | |__| (_| \__ \   <\__ \
#   \____\__,_|___/_|\_\___/

# Homebrew casks
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "dash"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "emacs"
cask "enpass"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "google-backup-and-sync"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "staruml"
cask "steam"
cask "syncthing-app"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
