#   _____
#  |_   _|_ _ _ __  ___
#    | |/ _` | '_ \/ __|
#    | | (_| | |_) \__ \
#    |_|\__,_| .__/|___/
#            |_|

tap "0xazure/tap"
tap "homebrew/cask-fonts"

#   _  __ 
#  | |/ /___  __ _ ___
#  | ' // _ \/ _` / __|
#  | . \  __/ (_| \__ \
#  |_|\_\___|\__, |___/
#            |___/

# Better `cat`
brew "bat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Better `du`
brew "dust"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Modern replacement for 'ls'
brew "exa"
# Identify or delete duplicate files
brew "fdupes"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for `git`
brew "git-delta"
# Safer, more feature-rich replacement for `git filter-branch`
brew "git-filter-repo"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"

#    ____                  ____          _
#   / ___|___  _ __ ___   / ___|__ _ ___| | _____
#  | |   / _ \| '__/ _ \ | |   / _` / __| |/ / __|
#  | |__| (_) | | |  __/ | |__| (_| \__ \   <\__ \
#   \____\___/|_|  \___|  \____\__,_|___/_|\_\___/

cask "alfred"
cask "disk-inventory-x"
cask "docker"
cask "enpass"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "sourcetree"
cask "spectacle"
cask "visual-studio-code"
cask "vlc"

#    ___        _   _                   _    ____          _
#   / _ \ _ __ | |_(_) ___  _ __   __ _| |  / ___|__ _ ___| | _____
#  | | | | '_ \| __| |/ _ \| '_ \ / _` | | | |   / _` / __| |/ / __|
#  | |_| | |_) | |_| | (_) | | | | (_| | | | |__| (_| \__ \   <\__ \
#   \___/| .__/ \__|_|\___/|_| |_|\__,_|_|  \____\__,_|___/_|\_\___/
#        |_|

# cask "android-file-transfer"
# cask "discord"
# cask "dropbox"
# cask "emacs"
# cask "google-backup-and-sync"
# cask "imageoptim"
# cask "jetbrains-toolbox"
# cask "skype"
# cask "spotify"
# cask "steam"
# cask "syncthing-app"
# cask "virtualbox"
